import Typography from "@material-ui/core/Typography";
import React from 'react';



const questions = [
  {
    question: "למה צריך תובענות ייצוגיות?",
    answer: (
      <Typography>
        ברוב המקרים נזקו של כל אחד מהקבוצה הינו קטן באופן יחסי, ואילו סכום
        תביעתם הכולל של חברי הקבוצה גבוה ביותר נוכח ריבוי מספרם. לכן, ישנה
        כדאיות בהגשת התובענה הייצוגית. יתרונות נוספים בהגשת תובענה ייצוגית הינם
        חיסכון במשאבים, מניעת ריבוי תביעות והגברת האחידות בהחלטות המתקבלות על
        ידי בתי המשפט בעניינים דומים.
      </Typography>
    ),
  },
  {
    question: "מי רשאי לתבוע תביעה ייצוגית?",
    answer: (
      <Typography>
        <p>
          יחיד שניזוק מהעילה ומשותפת לכלל הקבוצה בשמה הוא תובע – בשם אותה הקבוצה
        </p>
        <p>
          רשות ציבורית שבתחום אחת המטרות הציבוריות שבהן היא עוסקת בוצע המעשה
          שבגינו תובעת – בשם קבוצת האנשים שנפגעו מן המעשה.
        </p>
        <p>
          ארגון שבתחום אחת המטרות הציבוריות שבהן הוא עוסק בוצע המעשה מעורר
          התביעה – בשם קבוצת האנשים שנפגעו מן המעשה, אך ורק אם התובע השתכנע שאין
          ביכולת אדם פרטי להגיש את התביעה
        </p>
      </Typography>
    ),
  },
  {
    question: " מהו הגמול בתביעה ייצוגית?",
    answer: (
      <Typography>
        פיצוי בתביעה ייצוגית יכול להיות החזר, פיצוי או צו מניעה שאחיד לגבי
        הקבוצה, גם אם לא נקטו חלק פעיל בתביעה. כך למשך תובע ייצוגי יכול לטעון
        להקפצת מחירים אצל ספקית אינטרנט, והגמול יהיה החזר כספי לכל מנויי החברה.
      </Typography>
    ),
  },
  {
    question: "איך מצטרפים לתביעה ייצוגית?",
    answer: (
      <Typography>
        <p>
          אם בית המשפט מקבל תביעה כתביעה ייצוגית, כל אדם שרואה את עצמו כחלק
          מהקבוצה שבשמה התביעה הוגשה יכול להיות חלק מהתובעים. בעיתונים מתפרסמות
          ידיעות על אישור תביעה כתביעה ייצוגית, וכך למדים על האפשרות להצטרף
          לתביעה.
        </p>
        <p>
          באתר שלנו זה כל כך פשוט - לחץ על הצטרפות לתבוענה, תאר את המקרה שלך
          ואתה בפנים!
        </p>
      </Typography>
    ),
  },
  {
    question: "מה התובע הייצוגי (מוביל התובענה) מקבל?",
    answer: (
      <Typography>
        במקרה שהתביעה מתקבלת לתובע הייצוגי מגיע פיצוי מוגדל לעומת הקבוצה, בגין
        הזמן והטרחה שלקח על עצמו. פיצוי זה נקבע כדי לעודד אנשים להגיש תביעות
        ייצוגיות וכדי שלא יוותרו בגלל הזמן והטרחה, וכך הצרכן או הקבוצה יקבלו מה
        שמגיע להם.
      </Typography>
    ),
  },
];

export default questions;